Repository: paavkar/CommunicationsApp
Catalog: CommunicationsApp.SharedKernel/Localization/CommunicationsAppLoc.*.resx
Languages: fi_fi

source: Add server
fi_fi: Lisää palvelin

# AlreadyHaveAccount
source: Already have an account? Log in here
fi_fi: Onko sinulla jo käyttäjätili? Kirjaudu sisään täällä

# AlreadyInvitation
source: Do you already have an invitation?
fi_fi: Onko sinulla jo kutsu?

# AlreadyMember
source: You are already a member of this server.
fi_fi: Olet jo tämän palvelimen jäsen.

source: Cancel
fi_fi: Peruuta

source: Confirm Password
fi_fi: Varmista Salasana

source: Copy link
fi_fi: Kopioi linkki

# CreateNewAccount
source: Create a new account.
fi_fi: Luo uusi käyttäjätili.

source: Create new server
fi_fi: Luo uusi palvelin

source: Create own
fi_fi: Luo oma

source: Create own server
fi_fi: Luo oma palvelin

source: Display member list
fi_fi: Näytä jäsenluettelo

source: Display name
fi_fi: Näyttönimi

source: Email
fi_fi: Sähköposti

source: Email or username
fi_fi: Sähköposti tai käyttäjänimi

# EmptyInvitation
source: Invitation code cannot be empty.
fi_fi: Kutsu ei voi olla tyhjä.

# ForgotPassword
source: Forgot your password?
fi_fi: Unohditko salasanasi?

source: Go back
fi_fi: Palaa edelliselle

source: Hide member list
fi_fi: Piilota jäsenluettelo

# InvitationCodeOrLink
source: Server invitation link or code
fi_fi: Palvelimen kutsulinkki tai koodi

# InvitationsVisual
source: Invitations should look like the following ones:
fi_fi: Kutsujen tulisi näyttää seuraavanlaisilta:

source: Invite people
fi_fi: Kutsu ihmisiä

# InvitePeopleTo
source: Invite people to the server
fi_fi: Kutsu ihmisiä palvelimelle

# JoinExistingServerPaste
source: Join an existing server by pasting the invitation below
fi_fi: Liity olemassa olevalle palvelimelle liittämällä kutsu alle

source: Join server
fi_fi: Liity palvelimelle

source: Leave
fi_fi: Poistu

source: Leave server
fi_fi: Poistu palvelimelta

# LeaveServerConfirmation
source: Are you sure you want to leave the server
fi_fi: Oletko varma, että haluat poistua palvelimelta

source: Link copied!
fi_fi: Linkki kopioitu!

# LocalAccount
source: Use a local account to log in.
fi_fi: Käytä paikallista tiliä kirjautuaksesi sisään.

source: Log in
fi_fi: Kirjaudu sisään

source: Log out
fi_fi: Kirjaudu ulos

source: Member since
fi_fi: Jäsen alkaen

source: Open settings
fi_fi: Avaa asetukset

source: (Optional) Server description
fi_fi: (Valinnainen) Palvelimen kuvaus

source: Password
fi_fi: Salasana

source: Register
fi_fi: Rekisteröidy

# RegisterAsNew
source: Register as a new user
fi_fi: Rekisteröidy uutena käyttäjänä

source: Remember me
fi_fi: Muista minut

source: Resend email confirmation
fi_fi: Lähetä sähköpostin varmistus uudelleen

source: Save
fi_fi: Tallenna

# SendInvitation
source: Send the server's invitation link to someone
fi_fi: Lähetä palvelimen kutsulinkki jollekin

# SendMessage
source: Send a message to:
fi_fi: Lähetä viesti:

source: Server description
fi_fi: Palvelimen kuvaus

source: Server invitation
fi_fi: Palvelimen kutsu

source: Server name
fi_fi: Palvelimen nimi

source: Server owner
fi_fi: Palvelimen omistaja

# UseAnotherServiceRegister
source: Use another service to register.
fi_fi: Käytä ulkopuolista palvelua rekisteröityäksesi.

source: Username
fi_fi: Käyttäjätilin nimi

source: Welcome to channel
fi_fi: Tervetuloa kanavalle

# ServerProfileDisplayName
source: Display name for the server profile
fi_fi: Näyttönimi palvelinprofiilille

# ServerProfileStatus
source: Text status for the server profile
fi_fi: Tekstistatus palvelinprofiilille

# SetServerProfileDisplayNameStatus
source: Set display name and text status for the server profile
fi_fi: Aseta näyttönimi ja tekstistatus palvelinprofiilille

# SetServerProfile
source: Set the server profile for server
fi_fi: Aseta palvelinprofiili palvelimelle

# AddChannelClass
source: Add a new channel class
fi_fi: Lisää uusi kanavaluokka

# ChannelClassName
source: Name for the channel class
fi_fi: Kanavaluokan nimi

source: Channel
fi_fi: Kanava

# ChannelName
source: Name for the channel
fi_fi: Kanavan nimi

# PrivateClass
source: Private channel class
fi_fi: Yksityinen kanavaluokka

source: Private channel
fi_fi: Yksityinen kanava

source: New channel class
fi_fi: Uusi kanavaluokka

source: New channel
fi_fi: Uusi kanava

source: (Optional) Channel description
fi_fi: (Valinnanen) Kanavan kuvaus

# AddChannel
source: Add a new channel
fi_fi: Lisää uusi kanava

# AddAlsoChannel
source: Add also a channel?
fi_fi: Lisää myös kanava?

# SelectChannelClass
source: Select new channel's class
fi_fi: Valitse uuden kanavan kanavaluokka

# MakeSelection
source: Make a selection...
fi_fi: Tee valinta...

# ChannelClassNameRequired
source: Name for the channel class cannot be empty.
fi_fi: Kanavaluokan nimi ei voi olla tyhjä.

# ChannelClassNameUnique
source: Name for the channel class must be unique within the server.
fi_fi: Kanavaluokan nimen täytyy olla uniikki palvelimella.

# ChannelNameUnique
source: Name for the channel must be unique within the server.
fi_fi: Kanavan nimen täytyy olla uniikki palvelimella.

# ChannelNameRequired
source: Name for the channel cannot be empty.
fi_fi: Kanavan nimi ei voi olla tyhjä.

# ChannelClassNotSelected
source: You must choose a channel class for the channel.
fi_fi: Sinun täytyy valita kanavaluokka kanavalle.

# ServerNameRequired
source: Name for the server cannot be empty.
fi_fi: Palvelimen nimi ei voi olla tyhjä.

# AddServerPermissionsFirst
source: Administrator account must add available server permissions first.
fi_fi: Admin-käyttäjän täytyy lisätä palvelinoikeudet ensin.

# AddServerPermissions
source: Add available server permissions.
fi_fi: Lisää käyttäjien palvelinoikeudet.

# NoViewChannelsPermission
source: You do not have permission to view channels.
fi_fi: Sinulla ei ole oikeutta nähdä kanavia.

source: text channels
fi_fi: tekstikanavat

source: General
fi_fi: Yleinen

# GeneralDescription
source: General discussion channel
fi_fi: Tekstikanava yleiselle keskustelulle

source: Manage server
fi_fi: Hallinnoi palvelinta

source: Members
fi_fi: Jäsenet

source: Roles
fi_fi: Roolit

# ServerMembers
source: Server's members
fi_fi: Palvelimen jäsenet

source: Name
fi_fi: Nimi

source: Description
fi_fi: Kuvaus

# DescriptionPlaceholder
source: Tell something about this server (meaning, who is the target user).
fi_fi: Kerro jotain palvelimesta (tarkoitus, kenelle suunnattu ym.).

# ServerInfoUpdateError
source: There was an error updating the server info and/or description.
fi_fi: Palvelimen nimen ja/tai kuvauksen päivityksessä ilmeni ongelma.

source: Revert
fi_fi: Palauta

# RolesDescription
source: Use roles to group server members and set up permissions.
fi_fi: Käytä rooleja palvelimen jäsenten ryhmittelemiseen ja käyttöoikeuksien määrittämiseen.

source: Default permissions
fi_fi: Oletusoikeudet

# EveryoneRoleDescription
source: Applies to all server members
fi_fi: Koskevat kaikkia palvelimen jäseniä

source: Edit role
fi_fi: Muokkaa roolia

source: Display channels
fi_fi: Näytä kanavat

source: Manage channels
fi_fi: Hallinnoi kanavia

source: Manage roles
fi_fi: Hallinnoi rooleja

source: View logs
fi_fi: Katso valvontalokia

# CreateInvite
source: Create invitations
fi_fi: Luo kutsuja

# ChangeNickname
source: Change display name
fi_fi: Muuta näyttönimeä

# ManageNicknames
source: Manage display names
fi_fi: Hallinnoi näyttönimiä

# KickApproveMembers
source: Kick members, and approve and reject member applications
fi_fi: Jäsenien erottaminen ja jäsenhakemusten hyväksyntä ja hylkäys

source: Ban members
fi_fi: Anna porttikieltoja jäsenille

source: Timeout members
fi_fi: Aseta jäseniä jäähylle

source: Send messages
fi_fi: Lähetä viestejä

source: Send messages to threads
fi_fi: Lähetä viestejä ketjuihin

source: Create public threads
fi_fi: Luo julkisia ketjuja

source: Create private threads
fi_fi: Luo yksityisiä ketjuja

source: Embed links
fi_fi: Upota linkkejä

source: Attach files
fi_fi: Liitä tiedostoja

source: Add reactions
fi_fi: Lisää reaktioita

source: Manage messages
fi_fi: Hallinnoi viestejä

source: Manage threads
fi_fi: Hallinnoi ketjuja

source: Read message history
fi_fi: Lue viestihistoriaa

source: Admin privileges
fi_fi: Järjestelmänvalvojan oikeudet

# UnsavedChanges
source: You have unsaved changes.
fi_fi: Sinulla on tallentamattomia muutoksia.

source: Return
fi_fi: Takaisin

# RoleUpdateFailed
source: Failed to update role.
fi_fi: Roolin päivittäminen epäonnistui.

# SendingMessageError
source: There was an error sending the message. Try again later.
fi_fi: Viestin lähettämisessä ilmeni ongelma. Yritä myöhemmin uudelleen.

# SavingMessageError
source: There was an error saving the message. Try again later.
fi_fi: Viestin tallentamisessa ilmeni ongelma. Yritä myöhemmin uudelleen.

source: New role
fi_fi: Uusi rooli

source: Search roles
fi_fi: Etsi rooleja

# AddRoleError
source: There was an error creating the role.
fi_fi: Roolin luomisessa ilmeni ongelma.

source: Display
fi_fi: Näytä

source: Permissions
fi_fi: Käyttöoikeudet

# MemberManagement
source: Manage members
fi_fi: Jäsenten hallinta

# RoleName
source: Name of the role
fi_fi: Roolin nimi

# RoleColour
source: Colour for the role
fi_fi: Roolin väri

# RoleColourDescription
source: Members will use the role colour, that is the highest in hierarchy.
fi_fi: Jäsenet käyttävät sen roolinsa väriä, joka on korkeimmalla hierarkiassa.

# DisplaySeparately
source: Display members with the role separately from other members
fi_fi: Näytä roolin omaavat jäsenet erikseen muista jäsenistä

source: Search members
fi_fi: Etsi jäseniä

source: Add members
fi_fi: Lisää jäseniä

# ChooseAtMost
source: Choose at most {0}
fi_fi: Valitse enintään {0}

# NewRoleMembersMessage
source: {0} new members will be linked with the role.
fi_fi: {0} uutta jäsentä tullaan linkittämään rooliin.

source: Joined CA
fi_fi: Liittynyt CA

# KickMember
source: Kick {0}
fi_fi: Erota {0}

# BanMember
source: Ban {0}
fi_fi: Anna porttikielto {0}

source: More settings
fi_fi: Lisää asetuksia
